INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (55,48,'2023-03-30 13:00:00','2023-03-30 17:00:00','Xin nghỉ đi thi bằng lái xe ',2,'2023-03-28 16:33:01.359049','2023-03-29 08:46:28.231268',NULL,2,'okie',true),
	 (67,48,'2023-03-29 16:00:00','2023-03-29 17:00:00','có công việc cá nhân',2,'2023-03-29 13:22:19.207725','2023-03-29 13:57:09.046756',NULL,2,'ok',true),
	 (58,48,'2023-03-01 08:00:00','2023-03-01 08:30:00','Em (anh) xin đi muộn một chút',2,'2023-03-01 16:30:35.159458','2023-03-01 09:30:49.116277',NULL,2,'Duyệt',true),
	 (95,58,'2023-03-31 16:30:00','2023-03-31 17:30:00','Lý do: em vào trường có việc ạ!',2,'2023-03-31 07:59:46.016754','2023-03-31 14:16:20.977234',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-08 08:00:00','2023-03-08 10:00:00','Em có việc đột xuất ở trường',2,'2023-03-08 10:27:26.722853','2023-03-09 09:01:29.932185',NULL,1,'Duyệt',true),
	 (58,48,'2023-03-17 08:00:00','2023-03-17 09:30:00','Có việc đột xuất',2,'2023-03-17 09:49:17.425371','2023-03-17 09:49:38.654507',NULL,2,'Duyệt',true),
	 (93,58,'2023-04-11 13:30:00','2023-04-11 17:30:00','Có tiết ở trường',2,'2023-04-11 15:41:21.942266','2023-04-11 16:15:06.640423',NULL,1,'Duyệt',true),
	 (96,58,'2023-03-27 16:00:00','2023-03-27 17:30:00','có việc cá nhân',2,'2023-03-27 16:25:07.523393','2023-03-27 09:26:10.669017',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-01 13:00:00','2023-03-01 17:30:00','bận việc cá nhân',2,'2023-03-27 16:34:59.864651','2023-03-27 09:43:30.211563',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-13 17:00:00','2023-03-13 17:30:00','Có việc nhà đột xuất',2,'2023-03-27 16:36:38.442128','2023-03-27 09:43:26.282205',NULL,1,'Duyệt',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (93,58,'2023-03-14 08:00:00','2023-03-14 08:30:00',' Em xin đi muộn 30’',2,'2023-03-27 16:38:05.778437','2023-03-27 09:43:22.960318',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-15 08:00:00','2023-03-15 09:00:00','Em có tiết ở trường',2,'2023-03-27 16:38:53.189281','2023-03-27 09:43:21.153293',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-21 13:30:00','2023-03-21 17:30:00','Có việc gia đình',2,'2023-03-27 16:39:59.442784','2023-03-27 09:43:19.443728',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-23 08:00:00','2023-03-23 09:00:00','Em vào trường báo cáo tiến độ đồ án',2,'2023-03-27 16:40:57.314554','2023-03-27 09:43:17.066938',NULL,1,'Duyệt',true),
	 (93,58,'2023-03-24 08:00:00','2023-03-24 17:30:00','có việc  ở trường',2,'2023-03-27 16:41:53.986029','2023-03-27 09:43:08.214921',NULL,1,'Duyệt',true),
	 (96,58,'2023-03-24 08:00:00','2023-03-24 10:00:00','có việc cá nhân',2,'2023-03-24 16:57:10.697756','2023-03-24 16:57:10.697756',NULL,1,'Duyệt',true),
	 (96,58,'2023-03-10 08:00:00','2023-03-10 08:30:00','Có việc ở trường',2,'2023-03-10 16:59:59.785296','2023-03-10 16:59:59.785296',NULL,1,'Duyệt',true),
	 (95,58,'2023-03-06 10:00:00','2023-03-06 10:30:00','Có việc ở trường',2,'2023-03-06 17:03:02.537709','2023-03-06 17:03:02.537709',NULL,1,'Duyệt',true),
	 (91,58,'2023-03-06 08:00:00','2023-03-06 12:00:00','bận việc cá nhân',2,'2023-03-06 17:03:02.537709','2023-03-06 17:03:02.537709',NULL,1,'Duyệt',true),
	 (91,58,'2023-03-28 13:30:00','2023-03-28 17:30:00','Có việc cá nhân',2,'2023-03-28 08:33:33.308674','2023-03-28 08:33:33.308674',NULL,1,'Duyệt',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (58,48,'2023-03-15 08:00:00','2023-03-15 12:00:00','Nghỉ có việc bận cá nhân',2,'2023-03-14 13:27:24.107454','2023-03-14 13:43:07.781358',NULL,2,'Duyệt',true),
	 (58,48,'2023-03-27 08:00:00','2023-03-27 08:30:00','Em (anh) xin đến muộn một chút',2,'2023-03-27 16:21:03.559051','2023-03-27 16:21:03.559051',NULL,2,'Duyệt',true),
	 (96,58,'2023-03-31 16:00:00','2023-03-31 16:30:00','Có việc cá nhân',2,'2023-03-31 15:33:15.852526','2023-03-31 15:33:28.951573',NULL,1,'Duyệt',false),
	 (96,58,'2023-04-05 10:00:00','2023-04-05 12:00:00','Có chuyện gấp ',2,'2023-04-05 09:55:21.783608','2023-04-05 10:07:08.864748',NULL,1,'Duyệt',false),
	 (53,51,'2023-04-07 15:00:00','2023-04-07 17:00:00','Lý do cá nhân',2,'2023-04-07 10:12:16.64925','2023-04-07 10:13:15.530845',NULL,2,'Duyệt!!',true),
	 (92,58,'2023-04-10 13:30:00','2023-04-10 17:30:00','Lý do Xin về khám bệnh do số cao.',2,'2023-04-10 10:36:26.891785','2023-04-10 10:44:09.82651',NULL,1,'Duyệt',true),
	 (80,51,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 11:42:48.955778','2023-04-10 12:57:44.253578',NULL,1,'Phê duyệt đơn nghỉ phép',false),
	 (87,51,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 12:31:12.638937','2023-04-10 12:57:48.019355',NULL,1,'Phê duyệt đơn nghỉ phép',false),
	 (82,51,'2023-04-14 08:00:00','2023-04-14 17:30:00','Lý do tham gia dự lễ tốt nghiệp',2,'2023-04-10 14:43:52.026514','2023-04-10 16:31:10.37056',NULL,1,'Phê duyệt đơn nghỉ phép',false),
	 (85,51,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 14:52:36.542407','2023-04-10 16:31:13.433629',NULL,1,'Phê duyệt đơn nghỉ phép',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (86,58,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp ',2,'2023-04-10 15:14:43.078788','2023-04-10 17:30:16.914743',NULL,1,'Duyệt, chúc mừng em nhé',false),
	 (96,58,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 14:48:08.889344','2023-04-10 17:30:26.33204',NULL,1,'Duyệt, chúc mừng em nhé',false),
	 (58,58,'2023-04-03 08:00:00','2023-04-03 08:40:00','Em (anh) xin đi muộn một chút.',2,'2023-04-03 08:39:49.195878','2023-04-03 08:39:49.195878',NULL,2,'Quá hạn duyệt',true),
	 (95,58,'2023-04-13 00:00:00','2023-04-14 00:00:00','Em xin nghỉ để tham gia lễ tốt nghiệp ạ! 
Mong cty, anh Mạnh, anh Nghĩa tạo điều kiện cho em được nghỉ! 
Em xin chân thành cảm ơn ạ!',2,'2023-04-11 08:33:06.444388','2023-04-11 08:38:30.573001',NULL,1,'Duyệt, chúc mừng em nhé',false),
	 (60,69,'2023-04-13 12:45:00','2023-04-13 17:00:00','Lịch Thi Tiếng Anh',2,'2023-04-10 10:40:44.31318','2023-04-11 14:15:17.17982',NULL,2,'Duyệt',false),
	 (83,51,'2023-03-31 10:00:00','2023-03-31 17:30:00','Bệnh (sốt)',2,'2023-03-31 09:50:27.935341','2023-03-31 09:50:27.935341',NULL,1,'Duyệt',true),
	 (88,47,'2023-04-14 08:00:00','2023-04-14 17:30:00','Nhà có đám cưới của em trai',2,'2023-04-11 08:24:07.843683','2023-04-11 21:21:48.859658',NULL,1,'Đã xác nhận bạn cần phải bù lại ngày nghỉ do task chưa hoàn thành đúng tiến độ',false),
	 (81,47,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 14:46:34.033','2023-04-11 21:20:52.118957',NULL,1,'Đã xác nhận bạn cần phải bù lại ngày nghỉ do task chưa hoàn thành đúng tiến độ',false),
	 (79,47,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp.',2,'2023-04-11 16:21:08.829221','2023-04-11 21:22:05.392141',NULL,1,'Đã xác nhận bạn cần phải bù lại ngày nghỉ do task chưa hoàn thành đúng tiến độ',false),
	 (83,51,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ Tốt Nghiệp',2,'2023-04-11 11:44:19.809171','2023-04-12 16:54:03.389254',NULL,1,'Phê duyệt đơn nghỉ phép
Đảm bảo hoàn thành công việc vào ngày 13/04',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (77,52,'2023-04-14 08:00:00','2023-04-14 17:30:00','Làm lễ tốt nghiệp',2,'2023-04-10 08:23:46.156529','2023-04-12 15:51:33.074052',NULL,1,'Duyệt',false),
	 (93,58,'2023-04-14 13:30:00','2023-04-14 17:30:00','Em có tiết ở trường',2,'2023-04-14 09:14:08.718054','2023-04-14 14:26:14.807863',NULL,1,'Duyệt',true),
	 (106,38,'2023-03-29 00:00:00','2023-03-30 00:00:00','Xin phép nghỉ do bị ốm (Nghỉ đột xuất)',2,'2023-03-30 08:00:26.936794',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (76,58,'2023-04-14 08:00:00','2023-04-14 17:30:00','Dự lễ tốt nghiệp',2,'2023-04-11 09:18:20.316212','2023-04-14 15:56:24.358776',NULL,1,'Duyệt hộ anh Quỳnh',false),
	 (103,51,'2023-04-17 13:00:00','2023-04-17 17:00:00','đi kiểm tra sức khỏe',2,'2023-04-17 08:27:10.303921','2023-04-17 08:34:09.160657',NULL,2,'Phê duyệt đơn nghỉ phép
Note: Với những lịch nghỉ phép đã có kế hoạch trước, cần chủ động trong việc xin nghỉ phép.',true),
	 (63,47,'2023-04-17 08:00:00','2023-04-17 17:00:00','Đi làm giấy tờ tạm trú tạm vắng',2,'2023-04-17 08:43:08.499589','2023-04-17 08:57:28.571039',NULL,2,'Đã trao đổi để bù lại thời gian nghỉ hôm nay (17/04). Do đó phê duyệt nghỉ phép.',true),
	 (93,58,'2023-04-17 12:30:00','2023-04-17 17:30:00','Em có tiết ở trường',2,'2023-04-17 09:22:14.155592','2023-04-17 15:27:53.659798',NULL,1,'Duyệt',true),
	 (47,38,'2023-04-05 08:00:00','2023-04-05 11:45:00','Xử lý việc cá nhân',2,'2023-04-04 13:15:28.463325',NULL,NULL,2,'Quá hạn duyệt',false),
	 (63,38,'2023-04-05 08:00:00','2023-04-05 17:00:00','Có việc gia đình đột xuất ở quê',2,'2023-04-04 15:45:56.49238',NULL,NULL,2,'Quá hạn duyệt',false),
	 (93,38,'2023-04-05 08:00:00','2023-04-05 09:30:00','Em vào trường có việc đột xuất (Nghỉ đột xuất)',2,'2023-04-05 10:03:39.906035',NULL,NULL,1,'Duyệt bù do nghỉ đột xuất.',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (58,38,'2023-04-07 08:00:00','2023-04-07 08:30:00','Em xin đi muộn một chút có việc cá nhân ạ (Nghỉ đột xuất)',2,'2023-04-07 11:15:53.122337',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (51,38,'2023-04-10 08:00:00','2023-04-10 10:00:00','Có việc cá nhân đột xuất (Nghỉ đột xuất)',2,'2023-04-10 16:30:44.476288',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (158,38,'2023-04-11 08:00:00','2023-04-11 12:00:00','Nghỉ ốm (Nghỉ đột xuất)',2,'2023-04-11 13:34:16.205879',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (93,38,'2023-04-13 00:00:00','2023-04-14 00:00:00','Em vào trường chấm điểm đồ án (Nghỉ đột xuất)',2,'2023-04-14 09:07:31.520345',NULL,NULL,1,'Duyệt bù do nghỉ đột xuất.',false),
	 (58,38,'2023-04-17 08:00:00','2023-04-17 08:45:00','Em (anh) xin phép đi muộn tắc đường (Nghỉ đột xuất)',2,'2023-04-17 08:56:29.293634',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (55,38,'2023-04-17 08:00:00','2023-04-17 12:00:00','Xin nghủ đưa người nhà đi khám bệnh  (Nghỉ đột xuất)',2,'2023-04-17 12:53:26.016322',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (91,58,'2023-04-18 14:00:00','2023-04-18 15:00:00','Có việc cá nhân',2,'2023-04-18 09:53:23.321407','2023-04-18 09:53:41.861593',NULL,1,'Duyệt',true),
	 (103,51,'2023-04-19 13:00:00','2023-04-19 17:00:00','bác sỹ hẹn ngày kiểm tra lại',2,'2023-04-18 14:38:18.126342','2023-04-18 16:57:57.169333',NULL,2,'Phê duyệt xin nghỉ phép.',false),
	 (93,58,'2023-04-19 13:30:00','2023-04-19 17:30:00','Em có tiết ở trường',2,'2023-04-19 10:48:32.923912','2023-04-19 11:08:17.737204',NULL,1,'Duyệt',true),
	 (98,48,'2023-04-19 13:30:00','2023-04-19 17:30:00','Đi khám bệnh',2,'2023-04-19 11:31:53.45868','2023-04-19 11:38:54.376252',NULL,1,'ok',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (53,51,'2023-04-19 15:00:00','2023-04-19 17:00:00','Đi làm Căn Cước Công Dân',2,'2023-04-19 09:54:30.133645','2023-04-19 15:15:18.993463',NULL,2,'Phê duyệt đơn nghỉ phép.',true),
	 (82,51,'2023-04-21 13:30:00','2023-04-21 17:30:00','Bận việc gia đình',2,'2023-04-20 08:28:55.990313','2023-04-20 10:55:10.842589',NULL,1,'Phê duyệt xin nghỉ phép!',false),
	 (47,NULL,'2023-04-19 08:00:00','2023-04-20 17:30:00','viet tai lieu',3,'2023-04-19 09:54:38.957199',NULL,NULL,2,'Quá hạn duyệt',false),
	 (55,NULL,'2023-04-24 08:00:00','2023-04-24 12:00:00','Đưa người nhà đi tái khám ',3,'2023-04-20 08:22:02.974658',NULL,NULL,2,'Quá hạn duyệt',false),
	 (93,58,'2023-04-26 00:00:00','2023-04-27 00:00:00','PhongVT 26/04/2023 (8hh-17h30). Lý do: Em bảo vệ đồ án tốt nghiệp',2,'2023-04-26 01:15:11.988006','2023-04-26 01:15:39.487848',NULL,2,'Duyệt, chúc em bảo vệ đồ án tốt nhé',false),
	 (63,58,'2023-04-24 00:00:00','2023-04-25 00:00:00','Em có việc cá nhân',2,'2023-04-24 01:21:07.840475','2023-04-24 01:21:33.007855',NULL,2,'Duyệt hộ do quá hạn',false),
	 (93,58,'2023-04-25 10:00:00','2023-04-25 17:30:00','Em vào trường vợt báo cáo luận văn ạ',2,'2023-04-25 01:18:05.952179','2023-04-25 01:18:23.534186',NULL,1,'Duyệt',true),
	 (156,58,'2023-04-20 08:00:00','2023-04-20 17:00:00','Ốm',2,'2023-04-20 06:57:34.011826','2023-04-20 07:02:32.925465',NULL,2,'Duyệt hộ do quá hạn',true),
	 (67,58,'2023-04-17 00:00:00','2023-04-18 00:00:00','bận việc cá nhân',2,'2023-04-17 01:36:48.368273','2023-04-17 01:37:53.364488',NULL,2,'Duyệt hộ do quá hạn',false),
	 (60,69,'2023-04-28 12:45:00','2023-04-28 17:00:00','Về quê có việc gia đình',2,'2023-04-28 03:14:30.110607','2023-04-28 03:41:17.326165',NULL,2,'OK e',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (58,38,'2023-04-19 08:00:00','2023-04-19 11:45:00','Em xin nghỉ đi khám lại ạ (Nghỉ đột xuất)',2,'2023-04-19 12:38:16.467546',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (58,38,'2023-04-20 08:00:00','2023-04-20 08:30:00','Em xin phép đến muộn một chút (Nghỉ đột xuất)',2,'2023-04-20 08:33:00.848334',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (58,38,'2023-04-25 08:00:00','2023-04-25 09:00:00','em xin nghỉ 1h bận việc cá nhân (Nghỉ đột xuất)',2,'2023-04-25 09:58:41.491737',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (158,69,'2023-04-28 08:00:00','2023-04-28 17:00:00','Về quê có việc gia đình',2,'2023-04-25 06:39:44.81953','2023-04-26 02:58:31.952389',NULL,2,'Ok e',true),
	 (45,69,'2023-05-08 08:00:00','2023-05-08 17:00:00','có việc gia đình ',2,'2023-04-26 01:02:17.356804','2023-04-26 02:58:51.932217',NULL,2,'OK e',false),
	 (53,51,'2023-04-26 08:00:00','2023-04-26 10:00:00','Ốm, đau đầu ',2,'2023-04-26 03:22:38.891591','2023-04-26 03:46:04.799649',NULL,2,'Duyệt',true),
	 (93,53,'2023-04-28 13:30:00','2023-04-28 17:30:00','Vào trường để thi ',2,'2023-04-28 06:52:22.799264','2023-04-28 07:50:22.154798',NULL,1,'Duyệt',true),
	 (91,58,'2023-04-25 08:00:00','2023-04-25 17:30:00','Sốt cao, bệnh',2,'2023-04-25 09:06:33.54943','2023-04-25 09:09:31.402998',NULL,1,'Duyệt',false),
	 (93,58,'2023-04-20 00:00:00','2023-04-21 00:00:00','Em vào trường bảo vệ thử luận văn',2,'2023-04-20 09:22:59.694006','2023-04-20 09:23:16.073565',NULL,2,'Duyệt',false),
	 (82,51,'2023-04-28 13:30:00','2023-04-28 17:30:00','Lý do bận việc gia đình',2,'2023-04-26 03:30:09.092458','2023-04-26 10:06:35.941963',NULL,1,'Duyệt nghỉ, nhớ đảm bảo cv em nhé',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (93,58,'2023-04-27 16:45:00','2023-04-27 17:30:00','Em vào trường nộp giấy tờ',2,'2023-04-27 09:51:25.452537','2023-04-27 09:59:12.26395',NULL,1,'Duyệt',true),
	 (91,58,'2023-05-04 08:00:00','2023-05-04 17:30:00','Bệnh, đi chích ngừa',2,'2023-05-04 06:54:44.56535','2023-05-04 09:13:10.43105',NULL,1,'Duyệt',true),
	 (75,58,'2023-05-19 08:00:00','2023-05-19 17:00:00','Có việc cá nhân cần xử lý.',2,'2023-05-04 02:17:41.554603','2023-05-04 02:49:01.164448',NULL,2,'Duyệt hộ a Quỳnh',false),
	 (156,38,'2023-04-07 12:00:00','2023-04-07 17:00:00','Nghỉ việc riêng (Nghỉ đột xuất)',2,'2023-05-04 02:53:18.056036',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (61,38,'2023-04-27 08:00:00','2023-04-28 17:00:00','nhổ răng khôn (Nghỉ đột xuất)',2,'2023-05-04 02:37:09.556791',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (61,47,'2023-05-04 08:00:00','2023-05-04 17:00:00','có lịch tái khám ',2,'2023-05-04 08:06:13.495507','2023-05-04 08:06:13.495507',NULL,2,'Duyệt',true),
	 (96,58,'2023-05-04 17:00:00','2023-05-04 17:30:00','Có việc bận cá nhân',2,'2023-05-04 10:08:42.240328','2023-05-04 10:08:42.240328',NULL,1,'Duyệt',false),
	 (58,48,'2023-05-05 09:00:00','2023-05-05 10:00:00','Xin nghỉ đi khám lại',2,'2023-05-05 00:36:37.282057','2023-05-05 02:11:37.685653',NULL,1,'ok',true),
	 (93,58,'2023-05-05 09:00:00','2023-05-05 10:30:00','Em có việc cá nhân',2,'2023-05-05 01:23:30.894301','2023-05-05 02:30:20.625129',NULL,2,'Duyệt',true),
	 (95,58,'2023-05-04 08:00:00','2023-05-05 17:30:00','Em có việc cá nhân


',2,'2023-05-05 03:22:21.416002','2023-05-05 03:22:21.416002',NULL,2,'Duyệt',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (96,58,'2023-05-08 08:00:00','2023-05-08 17:30:00','Việc cá nhân',2,'2023-05-08 01:59:55.385426','2023-05-08 02:46:56.281369',NULL,2,'Duyệt',false),
	 (67,NULL,'2023-05-08 15:30:00','2023-05-08 17:00:00','lý do cá nhân',3,'2023-05-08 06:29:03.088767',NULL,NULL,1,'Quá hạn duyệt',false),
	 (96,58,'2023-05-10 08:00:00','2023-05-10 17:30:00','Có việc cá nhân',2,'2023-05-09 01:25:21.898498','2023-05-09 01:25:42.168608',NULL,2,'Duyệt',false),
	 (58,48,'2023-05-11 08:00:00','2023-05-11 11:45:00','Em xin phép nghỉ đột xuất có việc cá nhân',2,'2023-05-11 01:53:12.224153','2023-05-11 06:08:07.828398',NULL,1,'ok',true),
	 (50,49,'2023-05-12 13:00:00','2023-05-12 17:00:00','Xin nghỉ có việc cá nhân',2,'2023-05-11 08:25:17.17301','2023-05-11 08:46:07.594856',NULL,1,'đã xác nhận với bên dự án .',false),
	 (93,58,'2023-05-11 16:15:00','2023-05-11 17:30:00','Em bị đau bao tử',2,'2023-05-11 09:31:49.408701','2023-05-11 09:41:21.212569',NULL,2,'Duyệt',true),
	 (156,NULL,'2023-05-22 16:00:00','2023-05-22 17:00:00','Em xin nghỉ do có công việc cá nhân',3,'2023-05-22 09:18:13.906307',NULL,NULL,1,'Quá hạn duyệt',false),
	 (159,48,'2023-05-23 12:00:00','2023-05-23 17:00:00','Giải quyết công việc công ty cũ.',2,'2023-05-22 09:54:04.478829','2023-05-23 02:03:26.512386',NULL,1,'ok',false),
	 (96,58,'2023-05-11 08:00:00','2023-05-12 17:30:00','Có việc cá nhân',2,'2023-05-12 01:59:14.649324','2023-05-12 02:00:52.377291',NULL,2,'Duyệt',false),
	 (45,69,'2023-05-15 08:00:00','2023-05-15 17:00:00','đưa con đi khám ',2,'2023-05-12 01:18:21.77892','2023-05-12 10:02:55.32101',NULL,1,'Ok e',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (87,58,'2023-05-23 09:00:00','2023-05-23 17:30:00','Bị bệnh',2,'2023-05-23 01:49:56.106106','2023-05-23 02:09:59.5205',NULL,2,'Duyệt hộ',true),
	 (83,58,'2023-05-15 08:00:00','2023-05-16 17:30:00','Về quê có việc cá nhân (nội mất)',2,'2023-05-15 01:40:23.183504','2023-05-15 01:49:21.69153',NULL,2,'Duyệt hộ',false),
	 (93,58,'2023-05-12 08:00:00','2023-05-12 17:30:00','Em có việc gia đình',2,'2023-05-12 05:05:01.775427','2023-05-12 05:05:01.775427',NULL,2,'Duyệt',false),
	 (82,38,'2023-05-05 08:00:00','2023-05-05 17:30:00','về quê có việc gia đình (Nghỉ đột xuất)',2,'2023-05-08 02:02:53.173292',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (63,38,'2023-05-05 08:00:00','2023-05-05 17:00:00','Đưa vợ đi khám tiểu đường thai kỳ ở HN + tiêm uốn ván mũi 2 ở quê',2,'2023-05-04 02:06:55.14271','2023-05-04 02:06:55.14271',NULL,2,'Duyệt',true),
	 (58,NULL,'2023-05-16 08:00:00','2023-05-16 09:15:00','Em xin đến muộn một chút có việc cá nhân',3,'2023-05-16 01:45:41.468202',NULL,NULL,3,'Quá hạn duyệt',true),
	 (78,156,'2023-05-17 08:00:00','2023-05-17 12:00:00','Làm giấy tờ',2,'2023-05-17 03:06:13.530993','2023-05-17 03:57:17.940415',NULL,2,'Duyệt',true),
	 (63,156,'2023-05-18 08:00:00','2023-05-18 17:00:00','e bị ốm ạ',2,'2023-05-18 00:50:37.388044','2023-05-18 00:56:22.37032',NULL,1,'Duyệt',true),
	 (93,58,'2023-05-18 13:30:00','2023-05-18 17:30:00','Em có việc gia đình',2,'2023-05-18 03:53:58.778325','2023-05-18 07:10:25.786384',NULL,2,'Duyệt',true),
	 (52,58,'2023-05-18 08:00:00','2023-05-18 17:00:00','Có việc bận cá nhân',2,'2023-05-17 01:54:19.826172','2023-05-18 09:40:40.620087',NULL,1,'Duyệt hộ',false);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (58,38,'2023-05-25 08:00:00','2023-05-25 11:45:00','em có việc bận đột xuất',2,'2023-05-25 07:49:31.578249','2023-05-25 07:49:31.578249',NULL,2,'Duyệt',true),
	 (85,67,'2023-05-19 13:30:00','2023-05-19 17:30:00','Có việc cá nhân',2,'2023-05-19 03:33:23.72849','2023-05-19 05:05:52.512872',NULL,2,'Được nghỉ theo ngày phép vì lý do cá nhân',true),
	 (91,58,'2023-05-22 08:00:00','2023-05-22 13:30:00','có việc cá nhân',2,'2023-05-22 01:40:19.565355','2023-05-22 02:08:48.685585',NULL,2,'Duyệt',true),
	 (55,48,'2023-05-22 08:00:00','2023-05-22 12:00:00','Xin nghỉ do nhỡ xe từ quê lên ',2,'2023-05-22 06:29:08.004524','2023-05-22 06:30:05.871017',NULL,1,'ok',true),
	 (42,48,'2023-05-22 13:00:00','2023-05-22 17:00:00','Đi làm giấy tờ',2,'2023-05-22 06:30:06.582833','2023-05-22 06:30:55.730742',NULL,2,'ok',false),
	 (60,69,'2023-05-22 08:00:00','2023-05-22 12:00:00','Lý do cá nhân.',2,'2023-05-22 06:17:49.919567','2023-05-22 07:12:51.665958',NULL,1,'ok e',true),
	 (80,67,'2023-05-24 08:00:00','2023-05-24 17:30:00','Bệnh , sốt cảm, chóng mặt, nhức đầu',2,'2023-05-24 01:55:31.312187','2023-05-24 01:57:11.65277',NULL,2,'Được nghỉ phép theo quy định',true),
	 (71,156,'2023-05-24 16:00:00','2023-05-24 17:30:00','Đám cưới đồng nghiệp chi nhánh Nha Trang',2,'2023-05-24 01:58:50.923153','2023-05-24 02:09:02.138054',NULL,3,'Duyệt',true),
	 (63,156,'2023-05-24 08:00:00','2023-05-24 17:00:00','Ốm + đau đầu',2,'2023-05-24 01:52:03.569509','2023-05-24 02:09:30.949531',NULL,1,'Duyệt',true),
	 (80,38,'2023-05-26 08:00:00','2023-05-26 17:30:44','bị viêm mắt cấp tính',2,'2023-05-26 01:40:34.296763','2023-05-26 01:40:34.296763',NULL,2,'Quá hạn duyệt',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (63,156,'2023-05-23 12:00:00','2023-05-23 17:00:00','Có việc cá nhân',2,'2023-05-23 05:30:25.470557','2023-05-23 05:30:25.470557',NULL,2,'Duyệt',true),
	 (79,156,'2023-05-26 13:30:00','2023-05-26 17:30:00','Có việc về quê',2,'2023-05-24 10:25:44.67166','2023-05-26 02:11:22.142525',NULL,2,'Duyệt',false),
	 (62,69,'2023-05-29 08:00:00','2023-05-29 12:00:00','Lên trường có việc',2,'2023-05-26 03:52:41.057235','2023-05-26 03:55:58.83054',NULL,1,'Ok e',false),
	 (58,48,'2023-05-30 11:45:00','2023-05-30 17:00:00','Em xin nghỉ bận việc cá nhân',2,'2023-05-30 02:07:58.17888','2023-05-30 08:19:51.27212',NULL,1,'ok',true),
	 (42,48,'2023-05-29 08:00:00','2023-05-29 17:30:00','Đám dỗ ngoại',2,'2023-05-28 14:08:29.805311','2023-05-29 01:16:41.650313',NULL,2,'ok',false),
	 (73,NULL,'2023-06-05 08:00:00','2023-06-07 17:30:00','Bận việc gia đình.',1,'2023-05-31 07:51:52.722836',NULL,NULL,2,NULL,false),
	 (84,38,'2023-05-16 13:30:00','2023-05-16 17:30:00','Có việc cá nhân cần về quê',2,'2023-05-16 05:51:02.750809','2023-05-16 05:51:02.750809',NULL,2,'Duyệt bù do nghỉ đột xuất.',true),
	 (58,48,'2023-05-18 16:00:00','2023-05-18 17:00:00','Em có việc gia đình, e xin về sớm',2,'2023-05-18 07:11:12.689713','2023-05-18 07:11:12.689713',NULL,2,'Duyệt',true),
	 (84,38,'2023-05-17 00:00:00','2023-05-18 00:00:00','Làm giấy tờ (Nghỉ đột xuất)',2,'2023-05-24 03:00:11.132053',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (91,58,'2023-05-29 15:30:00','2023-05-29 17:30:00','Có việc cá nhân',2,'2023-05-29 09:15:55.560566','2023-05-29 09:15:55.560566',NULL,2,'Duyệt',true);
INSERT INTO public."Leave_Off" ("idLeaveUser","idAcceptUser","startTime","endTime",reasons,status,"createTime","acceptTime","ReasonNotAccept","idCompanyBranh","ReasonAccept","flagOnDay") VALUES
	 (65,38,'2023-05-24 08:00:00','2023-05-25 12:00:00','Do mệt nên xin nghỉ và đi khám thai (Nghỉ đột xuất)',2,'2023-05-26 06:38:46.026382',NULL,NULL,1,'Duyệt bù do nghỉ đột xuất.',false),
	 (63,156,'2023-05-25 08:00:00','2023-05-25 17:00:00','Ốm',2,'2023-05-25 01:08:00.107264','2023-05-25 01:08:00.107264',NULL,2,'Quá hạn duyệt',true),
	 (84,47,'2023-05-24 13:30:00','2023-05-24 17:30:00','Có việc cá nhân',2,'2023-05-24 03:01:15.405227','2023-05-24 03:01:15.405227',NULL,2,'Duyệt',true),
	 (67,NULL,'2023-05-30 08:00:00','2023-05-30 17:00:00','xin nghỉ ốm (Nghỉ đột xuất)',2,'2023-05-31 01:06:13.822164',NULL,NULL,1,'Duyệt bù do nghỉ đột xuất.',false),
	 (70,38,'2023-05-12 08:00:00','2023-05-12 17:00:00','em ốm (Nghỉ đột xuất)',2,'2023-05-15 03:13:15.022002',NULL,NULL,1,'Duyệt bù do nghỉ đột xuất.',false),
	 (88,47,'2023-05-31 08:00:00','2023-05-31 17:30:00','Có việc cá nhân',2,'2023-05-29 03:28:44.355164','2023-05-31 02:20:14.014432',NULL,2,'Chú ý : lý do nghỉ phép phải cụ thể, hạn chế sử dụng lý do việc cá nhân.
Phê duyệt lần này để nhắc nhở nhé :)))',false),
	 (78,NULL,'2023-05-15 13:30:00','2023-05-15 17:30:00','Có việc cá nhân (Nghỉ đột xuất)',2,'2023-05-31 14:55:48.619267',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false),
	 (78,NULL,'2023-05-16 08:00:00','2023-05-16 12:00:00','Có việc cá nhân
 (Nghỉ đột xuất)',2,'2023-05-31 14:56:37.836369',NULL,NULL,2,'Duyệt bù do nghỉ đột xuất.',false);
